Revit 2027 API
PipeFittingAndAccessoryConnectorData Properties
The PipeFittingAndAccessoryConnectorData type exposes the following members.
Properties
Name | Description
Angle |  The angle of the fitting, Units:(rad).
Diameter |  The connector diameter, Units:(ft).
Flow |  The connector flow, Units:(ft³/s)
FlowDirection |  The flow direction of this connector, In or Out.
Height |  The connector height, Units:(ft).
Index |  Return the index of this connector
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LinkIndex |  The index of the connector which is linked with this connector
Profile |  The connector profile.
VelocityPressure |  The connector velocity pressure. Units: (kg/(ft·s²)).
Width |  The connector width, Units:(ft).
Top
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace